dataset_gen/NS_datasets/LDC/Regular/Design_Point_0/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
0.1
0.1
0.1
0.1
0.1
0.1
0.1
0.1
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform 0.1;
    }
    fixedWalls
    {
        type            calculated;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
